Revit 2026 API

# LoadClassification Enumeration

---

An enumerated type to list all demand factor classifications.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LoadClassification
```
```vb
Public Enumeration LoadClassification
```
```cpp
public enum class LoadClassification
```
```fsharp
type LoadClassification
```

| Member name | Value | Description |
| --- | --- | --- |
| Hvac | 3 | Load classification is HVAC. |
| Lighting | 2 | Load classification is Lighting. |
| Power | 1 | Load classification is power. |
| Undefined | 0 | Load classification is undefined. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace